
INSERT INTO districts VALUES
(1,'Западный внутригородской округ'),
(2,'Карасунский внутригородской округ'),
(3,'Прикубанский внутригородской округ'),
(4,'Центральный внутригородской округ'),
(5,'Берёзовский сельский округ'),
(6,'Елизаветинский сельский округ'),
(7,'Калининский сельский округ'),
(8,'Пашковский сельский округ'),
(9,'Старокорсунский сельский округ'),
(10,'Департамент транспорта и дорожного хозяйства')
;

INSERT INTO branches VALUES
(1,'Неизвестные','Предустановленные'),
(2,'Торговля продуктами питания, продовольственными товарами и непродовольственными товарами первой необходимости','Предустановленные'),
(3,'Средства массовой информации (СМИ)','Предустановленные'),
(4,'Услуги медицинских и фармацевтических организаций, специалистов и организаций в области ветеринарии','Предустановленные'),
(5,'Услуги доставки товаров (медикаментов) первой необходимости на дом по заявкам граждан, находящихся в режиме самоизоляции, специально обученными волонтёрами, имеющими соответствующий сертификат (удостоверение) волонтёра','Предустановленные'),
(6,'Услуги образовательных организаций высшего образования, профессиональных образовательных организаций, научных институтов в части осуществления трудовой функции административных, технических, инженерных и иных работников (перечень работников утверждается локальным актом организации), обеспечивающих функционирование указанных организаций','Предустановленные'),
(7,'Услуги дошкольных образовательных организаций, общеобразовательных организаций, организаций дополнительного образования в части осуществления трудовой функции административных, технических, инженерных работников, обеспечивающих функционирование указанных организаций, а также работников, обеспечивающих реализацию образовательного процесса по программам начального общего, основного общего и среднего общего образования в дистанционном режиме (перечень работников утверждается локальным актом организации)','Предустановленные'),
(8,'Услуги тепло-, водо- , газо-, электроснабжения, связи и транспорта','Предустановленные'),
(9,'Услуги регионального оператора по обращению с твёрдыми коммунальными отходами','Предустановленные'),
(10,'Услуги управления многоквартирными домами','Предустановленные'),
(11,'Услуги банковских (кредитных) организаций, некредитных финансовых организаций, а именно: страховых компаний, негосударственных пенсионных фондов, специализированных депозитариев, микрофинансовых организаций, лизинговых компаний, кредитных потребительских кооперативов, ломбардов;','Предустановленные'),
(12,'Услуги АЗС и охранных организаций','Предустановленные'),
(13,'Услуги совершения религиозных обрядов и церемоний','Предустановленные'),
(14,'Услуги лиц, осуществляющих адвокатскую деятельность, получивших статус адвоката в установленном действующим законодательством порядке','Предустановленные'),
(15,'Услуги организаций и индивидуальных предпринимателей, обеспечивающих деятельность организаций, указанных в настоящем пункте, в части обеспечения охраны, санитарной обработки объектов таких организаций и индивидуальных предпринимателей и их экспедиционного обслуживания','Предустановленные'),
(16,'Производство пищевых продуктов','Предустановленные'),
(17,'Производство напитков','Предустановленные'),
(18,'Производство табачных изделий','Предустановленные'),
(19,'Производство средств индивидуальной защиты, лицевых масок, одноразовых перчаток и т.п.','Предустановленные'),
(20,'Производство санитарно-гигиенических изделий и туалетных принадлежностей, сырья для их изготовления','Предустановленные'),
(21,'Производство мыла и моющих средств, чистящих средств','Предустановленные'),
(22,'Производство лекарственных средств, медицинских изделий и дезинфицирующих средств, а также материалов, применяемых в медицинских целях','Предустановленные'),
(23,'Производство строительных материалов, в том числе изделий из стекла и пластика, применяемых в строительстве','Предустановленные'),
(24,'Производство нефтепродуктов','Предустановленные'),
(25,'Металлургическое и литейное производство','Предустановленные'),
(26,'Производство продукции для оборонно-промышленного комплекса','Предустановленные'),
(27,'Производство медицинского оборудования и инструментов','Предустановленные'),
(28,'Производство оборудования для химической, фармацевтической, лёгкой промышленности, жилищно-коммунального хозяйства','Предустановленные'),
(29,'Производство оборудования для пищевой промышленности, пищевого оборудования и сельскохозяйственной техники','Предустановленные'),
(30,'Производство упаковки, тары, этикеток, одноразовой посуды','Предустановленные'),
(31,'Ремонт оборудования, в том числе лифтов, электрического оборудования','Предустановленные'),
(32,'Производство сырья, компонентов и комплектующих для указанных выше видов деятельности','Предустановленные'),
(33,'Оказание ритуальных услуг','Предустановленные'),
(34,'Оказание услуг общественного питания с обслуживанием на вынос, а также с доставкой заказов','Предустановленные'),
(35,'Оказание услуг по техническому обслуживанию автотранспортных средств индивидуальным предпринимателям и организациям, осуществляющим реализацию продовольственных товаров или непродовольственных товаров первой необходимости, указанных в распоряжении Правительства РФ от 27.03.2020 № 762-р','Предустановленные'),
(36,'Оказание услуг по мойке автотранспортных средств индивидуальным предпринимателям и организациям, осуществляющим реализацию продовольственных товаров или непродовольственных товаров первой необходимости, указанных в распоряжении Правительства РФ от 27.03.2020 № 762-р','Предустановленные'),
(37,'Деятельность организаций, индивидуальных предпринимателей, обеспечивающих всю товаропроводящую цепочку продовольственных и непродовольственных товаров первой необходимости от производителя до конечного потребителя, включая производителей, поставщиков, дистрибьютеров, транспортно-логистические организации, логистические комплексы, а также деятельность организаций, оказывающих услуги по подготовке, обработке, упаковке товаров и иных подобных услуг, распределительных центров, оптовых рынков, складов, служб доставки, курьерских служб, пунктов выдачи заказов, объектов торговли всех форматов','Предустановленные'),
(38,'Производство продукции растениеводства и предоставления соответствующих услуг в этой области','Предустановленные'),
(39,'Производство продукции животноводства и предоставления соответствующих услуг в этой области','Предустановленные'),
(40,'Коневодство и племенные испытания лошадей','Предустановленные'),
(41,'Рыболовство и рыбоводство','Предустановленные'),
(42,'Ремонт и сервисное обслуживание сельскохозяйственной техники','Предустановленные'),
(43,'Торговля семенами, рассадой, средствами защиты растений, удобрений, ГСМ и ветеринарными лекарственными средствами','Предустановленные'),
(44,'Транспортно-логическая деятельность, задействованная в производстве и переработке сельскохозяйственной продукции','Предустановленные'),
(45,'Деятельность, связанная с формированием товарных запасов сельскохозяйственной продукции и продовольствия на будущие периоды','Предустановленные'),
(46,'Деятельность организаций, федеральных научных центров, проводящих фундаментальные поисковые и прикладные научные исследования в области селекции семеноводства сельскохозяйственных культур и животноводства','Предустановленные'),
(47,'Строительство, в том числе жилищное строительство в целях достижения показателей национального проекта «Жильё и городская среда», включая организации, осуществляющие свою деятельность с привлечением работников с использованием вахтового метода работы, а также организаций, обеспечивающие организации строительными материалами','Предустановленные'),
(48,'Санитарно-курортные, гостиничные услуги лицам, прибывшим до 28.03.2020 на территорию Краснодарского края и находящимся в служебных командировках и служебных поездках','Предустановленные')
;

INSERT INTO users VALUES
(1,'dev@quartex.ru','$2y$13$cxYIxLQLSmi2OuhASQdC8.gEq2I2X8UcnbujfXd98RHuheIOOYgUO',NULL,1,'2020-04-06 17:49:51','2020-04-07 19:24:10','QDev','-','-','-'),
(3,'dt-dispetcher@quartex.ru','$2y$13$gayzCEDtTP22/V9bRct0veziGhAPnxEr42TOJLiv838M28w43nnjS',NULL,10,'2020-04-08 12:49:24','2020-04-08 12:50:55','Иванов','иван','иванович','главный'),
(4,'karasun@quartex.ru','$2y$13$U4q7QCzAs.6WKziDqarJN.wg2tBy6tzD2U/e2lg/PrPxorcm1ox46',NULL,2,'2020-04-08 22:33:30','2020-04-08 22:33:30','Карасунский оператор','иван','иваныч','самый главный'),
(5,'zapad@quartex.ru','$2y$13$jzEt9gQugZaToG0tgM6hQ.P8DhgUVyyMnVb87ReP3upaYZ9BM36mC',NULL,1,'2020-04-08 22:46:28','2020-04-08 22:46:28','Запад','Анна','Ванна','оператор западного')
;

INSERT INTO companies VALUES
(1, 0, 0, "Компания без ИНН и ОГРН", 1, 0);

INSERT INTO companies_people VALUES
(1, 0, 0, "Компания без ИНН и ОГРН", 1, 0);

INSERT INTO sources (id, name, title) VALUES
(1, "excel", "Файл заявка Excel"),
(2, "form-struct", "Formstruct письмо"),
(3, "form-structdump", "Formstruct БД"),
(4, "gsheet-vehicle", "Файл Google"),
(5, "excel-registry", "Файл реестр Excel"),
(6, "gsheet-people", "Файл Google людей"),
(7, "form.vehicle", "Форма пропуска транспорта компании"),
(8, "from.people", "Форма пропуска сотрудников компании"),
(9, "form.single", "Форма пропуска ТС граждан")
;

/*
INSERT INTO routing (id, source_id, district_id, clean_id, dirty_id) VALUES
(1, 4, 1, 1, 1),
(2, 5, 1, 1, 1),
(3, 6, 1, 1, 1),
(4, 7, 1, 1, 1)
;
*/

-- INSERT INTO routing (source_id, district_id, clean_id, dirty_id) VALUES (7, 10, 1, 1),